/////////////////////////////////////////////////////////////////////
//此文件的目的:对应一种屏做一个lcdset.h的头文件,其他都不必改动
//////////////////////////////////////////////////////////////////////
#ifndef __LCDSET_H__
#define __LCDSET_H__


#define M5D(n) ((n) & 0x1fffff)	// To get lower 21bits
/*************************************************************************
*在此选择是何种屏,tft/stn/monopoly
**************************************************************************/
#define _TFT   1
//-------------------------------------------------------------------------

///////////////////////////////////////////////////////////////////////////////

#ifdef _TFT
/**************************************************************************
*勤研的TD035STEB1开发板自带的lcd设定
* 24位bpp,tft 单扫
****************************************************************************/
////////LCD屏的尺寸/////////////////////////////////////////////////
#define LCD_X     (480)
#define LCD_Y     (272)
////////虚拟屏的尺寸////////////////////////////////////////////////
#define LCD_VIRSUAL_SCR_X     (LCD_X*2)
#define LCD_VIRSUAL_SCR_Y     (LCD_Y*2)

///////////////////////////////////////////////////
///////////////////////////////////////////////////
//LCD control 1 Register,about lcd 总体的设定
///VCLK=HCLK/[CLKVAL+1)*2],此处vclk指Dclk,hclk指系统的高频时钟与pclk等一致.
#define CLKVAL	 5
////对stn有另用,对tft设0////////////////////
#define MMODE    1
/////选择屏的类型为tft/////////////////////////////
#define PNRMODE  3
//////选择bit per pixel 这儿选24bpp/////////////////////////////////////////////
#define BPPMODE  13
////////lcd 输出开关0,off;1,on///////////////////////////////////////////
#define ENVID     0

//////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////
//LCD control 2 Register,about lcd 纵向的设定
/////在一帧同步信号后的回扫时间,非激活行数///////////////////////
#define VBPD    		((4-1)&0xff)
//////lcd纵向的行数/////////////////////////////////////////////
#define LINEVAL         (LCD_Y-1)
///////一帧中同步信号前的非激活行数//////////////////////////////
#define VFPD    		((2-1)&0xff)
////////纵向同步脉冲高电平宽度///////////////////////////////////
#define VSPW        	((3-1) &0x3f)

///////////////////////////////////////////////////
///////////////////////////////////////////////////
//LCD control 3 Register,about lcd 横向的设定
///////水平回扫期,在行同步下降沿和激活区之间/////////////////////
#define HBPD    		((2-1)&0x7f)
///////水平点数(对24位bpp而言)///////////////////////////////////
#define HOZVAL          (LCD_X-1)
////////水平前扫时间,指在数据激活区后和行同步前的DCLK数//////////
#define HFPD        	((16-1)&0xff)

///////////////////////////////////////////////////
///////////////////////////////////////////////////
//LCD control 4 Register,about lcd 总体的设定
//仅对stn屏有效
#define MVAL             (13)      
////////水平同步信号高电平宽度,用vclk(dclk)数目计算///////////////////////////////////////////
#define HSPW    		((3-1)&0xff)

//LCD control 5 Register,about lcd 状态的读取,极性的设定
///////////////24bpp数据格式0:lsb,1:msb
#define  BPP24BL    0
////////////////当用16bpp时,输出数据格式0指5:5:5:1format,1指5:6:5format
#define  FRM565     1
////////点时钟同步脉冲极性:0,normal;1,inverted///////////////////////////////////////////
#define  INVVCLK    1
////////行同步脉冲极性:0,normal;1,inverted///////////////////////////////////////////
#define  INVVLINE   1
////////帧同步脉冲极性:0,normal;1,inverted///////////////////////////////////////////
#define  INVVFRAME  1
/////////vd(video data)的脉冲极性:0,normal;1,inverted//////////////////////////////////////////
#define  INVVD      0
//--------虚拟屏空间问题------------------------------------
#define LCDFRAMEBUFFER    0x33800000      //_NONCACHE_STARTADDRESS         

#define	frameBuffer    ((U32 (*)[LCD_VIRSUAL_SCR_X])LCDFRAMEBUFFER)

//lcdbank须确保4Mbuffer在同一个bank里
#define LCDBAND		(LCDFRAMEBUFFER>>22)
#define LCDBASEU	M5D(LCDFRAMEBUFFER)
//*4的原因,对于24位而言,需3个字节,实际用的是int型,32位,4个字节表示一个像素点,最高8位不用的.
#define LCDBASEL    M5D(LCDFRAMEBUFFER+(LCD_VIRSUAL_SCR_X*LCD_Y*4))
//(LCD_VIRSUAL_SCR_X-LCD_X)个偏移点,需*4个字节,需/2个halfword(半字);一般用位来表示*32/16.
#define OFFSIZE		((LCD_VIRSUAL_SCR_X-LCD_X)*4/2)
//LCD_X个点的pagewidth,需*4个字节,需/2个半字,一般用位来表示*32/16.
#define PAGEWIDTH   (LCD_X*4/2)
//--------------------------------------------

#endif   //对应于 #ifdef _TFT
////////////////////////////////////////////////////////////////////////
#endif /*__LCDSET_H__*/
